Core/src/src/Catalogs/СкидкиПоСрокуГодностиТовара/СкидкиПоСрокуГодностиТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СкидкиПоСрокуГодностиТовара</name>
  <attributes>
    <name>ТипСравнения</name>
    <type>
      <types>EnumRef.ТипыСравненияЗначенийСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеУсловияОграничения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьОграничения</name>
    <type>
      <types>EnumRef.ВариантыОбластейОграниченияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>КритерийОграничения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПредоставления</name>
    <type>
      <types>EnumRef.СпособыПредоставленияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеСкидкиНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Естьруппа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУточненияПоНоменклатуре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Скиди</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/Enums/ВариантыОбластейОграниченияСкидокНаценок/ВариантыОбластейОграниченияСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОбластейОграниченияСкидокНаценок</name>
  <enumValues>
    <name>ВДокументе</name>
  </enumValues>
  <enumValues>
    <name>ВСтроке</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Catalogs/СкидкиПоСрокуГодностиТовара/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ОбластьОграничения.РежимВыбораИзСписка = Истина;
	Элементы.ОбластьОграничения.СписокВыбора.Добавить(Перечисления.ВариантыОбластейОграниченияСкидокНаценок.ВСтроке);	
	Объект.ОбластьОграничения = Перечисления.ВариантыОбластейОграниченияСкидокНаценок.ВСтроке;		
	Объект.КритерийОграничения =НСтр("ru = 'Срок Годности'; ka = 'ვარგისიანობის ვადა'");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьПризнакиВТЧ();
	
	ТипПолучателяСкидкиПредыдущий = ТипПолучателяСкидки;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПризнакиВТЧ()

	
	Для Каждого ТекущаяСтрока Из Объект.Скиди Цикл
		ТекущаяСтрока.ХарактеристикиИспользуются = ТекущаяСтрока.Номенклатура.ИспользоватьХарактеристики;
		ТекущаяСтрока.ЭтоГруппа = ТекущаяСтрока.Номенклатура.ЭтоГруппа;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ОбновитьАвтонаименование(Модифицированность);
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьПризнакиВТЧ();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьГруппу(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ДобавитьГруппуНоменклатурыЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",, ЭтотОбъект,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры


&НаКлиенте
Процедура РежимВыбораГруппИЭлементов(Команда)
	
	Если Элементы.СкидиНоменклатура.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы Тогда 
		Элементы.СкидиНоменклатура.ВыборГруппИЭлементов =   ГруппыИЭлементы.Группы ;
		Элементы.СкидиНоменклатура.ПодсказкаВвода = НСтр("ka='ნომენკლატურა(ჯგუფი)';ru=' Номенклатура(группа)'");
		Элементы.СкидиРежимВыбораГруппИЭлементов.Картинка  = БиблиотекаКартинок.РежимВыбораГрупп;
		Объект.Естьруппа = Истина;
		Объект.Скиди.Очистить();
	Иначе 
		Элементы.СкидиНоменклатура.ВыборГруппИЭлементов =   ГруппыИЭлементы.Элементы ;
		Элементы.СкидиНоменклатура.ПодсказкаВвода = НСтр("ka='ნომენკლატურა';ru=' Номенклатура'");
		Элементы.СкидиРежимВыбораГруппИЭлементов.Картинка  = БиблиотекаКартинок.РежимВыбораЭлементов;
		Объект.Естьруппа = Ложь;
		Объект.Скиди.Очистить();	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьГруппуНоменклатурыЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		НоваяСтрока = Объект.Скиди.Добавить();
		НоваяСтрока.Номенклатура = РезультатЗакрытия;
		Элементы.Скиди.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьАвтонаименование(Обновить = Истина)
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) ИЛИ (Обновить И ИспользуетсяАвтоНаименование И Не НаименованиеИзмененоПользователем) Тогда
		Объект.Наименование = СформироватьАвтоНаименованиеНаКлиенте();
		ИспользуетсяАвтоНаименование = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьАвтоНаименованиеНаКлиенте()
	
	//Элементы.Наименование.СписокВыбора.Очистить();
	//
	//Если Объект.Скиди.Количество() > 0 Тогда
	//	СтрокаНаименования = СтрокаНаименования + ": " + ОписаниеТабличнойЧастиКлиент("Скиди", "Номенклатура");
	//КонецЕсли;
	//
	//Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	//
	//Возврат СтрокаНаименования;
	
КонецФункции

&НаКлиенте
Функция ОписаниеТабличнойЧастиКлиент(ИмяТаблицы, ИмяРеквизита, КоличествоЭлементов = 0)

	ОписаниеТаблицы = "";
	
	НомерЭлемента = 0;
	Для каждого ЭлементТаблицы Из Объект[ИмяТаблицы] Цикл
		
		НомерЭлемента = НомерЭлемента + 1;
		Если Не КоличествоЭлементов = 0 И (КоличествоЭлементов + 1) = НомерЭлемента Тогда
			ОписаниеТаблицы = ОписаниеТаблицы + "... ,";
		ИначеЕсли Не КоличествоЭлементов = 0 И (КоличествоЭлементов + 1) < НомерЭлемента Тогда
			Прервать;
		Иначе
			ОписаниеТаблицы = ОписаниеТаблицы + Строка(ЭлементТаблицы[ИмяРеквизита]) + ", ";
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ОписаниеТаблицы = "" Тогда
	
		ОписаниеТаблицы = Лев(ОписаниеТаблицы, СтрДлина(ОписаниеТаблицы) - 2);
	
	КонецЕсли;
	
	Возврат ОписаниеТаблицы;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыСкиди

&НаКлиенте
Процедура СкидиНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Скиди.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.ХарактеристикиИспользуются = СтруктураДанные.ХарактеристикиИспользуются;
	СтрокаТабличнойЧасти.ЭтоГруппа = СтруктураДанные.ЭтоГруппа;

КонецПроцедуры

&НаКлиенте
Процедура СкидиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Объект.Наименование = СформироватьАвтоНаименованиеНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СкидиПослеУдаления(Элемент)
	Объект.Наименование = СформироватьАвтоНаименованиеНаКлиенте();
КонецПроцедуры


#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("ХарактеристикиИспользуются", СтруктураДанные.Номенклатура.ИспользоватьХарактеристики);
	СтруктураДанные.Вставить("ЭтоГруппа", СтруктураДанные.Номенклатура.ЭтоГруппа);
	
	Возврат СтруктураДанные;
	
КонецФункции 

#КонецОбласти
